nvme/xarray-v5/linked-list5.fio.log
test1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test3: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test4: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test5: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test6: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test7: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test8: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test9: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test10: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test11: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test12: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test13: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test14: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test15: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test16: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test17: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test18: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test19: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test20: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test21: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test22: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test23: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test24: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test25: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test26: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test27: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test28: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test29: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test30: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test31: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test32: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
fio-3.8-5-g464b
Starting 32 processes

test1: (groupid=0, jobs=32): err= 0: pid=28869: Wed Aug  5 19:23:43 2020
   read: IOPS=1545k, BW=6037MiB/s (6330MB/s)(354GiB/60001msec)
    slat (usec): min=2, max=4639, avg= 4.90, stdev= 1.57
    clat (usec): min=8, max=4801, avg=35.69, stdev= 8.84
     lat (usec): min=22, max=4951, avg=40.67, stdev= 9.06
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   27], 10.00th=[   28], 20.00th=[   29],
     | 30.00th=[   30], 40.00th=[   31], 50.00th=[   33], 60.00th=[   39],
     | 70.00th=[   41], 80.00th=[   43], 90.00th=[   46], 95.00th=[   49],
     | 99.00th=[   57], 99.50th=[   60], 99.90th=[   68], 99.95th=[   76],
     | 99.99th=[  145]
   bw (  KiB/s): min=109960, max=242176, per=3.13%, avg=193198.04, stdev=31718.21, samples=3808
   iops        : min=27490, max=60544, avg=48299.48, stdev=7929.55, samples=3808
  lat (usec)   : 10=0.01%, 20=0.01%, 50=96.13%, 100=3.85%, 250=0.02%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=7.00%, sys=29.35%, ctx=46365676, majf=0, minf=494
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=92730815,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=6037MiB/s (6330MB/s), 6037MiB/s-6037MiB/s (6330MB/s-6330MB/s), io=354GiB (380GB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n3: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n4: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n5: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n6: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n7: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n8: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n9: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n10: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n11: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n12: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n13: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n14: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n15: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n16: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n113: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n114: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n115: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n116: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n117: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n118: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n119: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n120: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n121: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n122: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n123: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n124: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n125: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n126: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n127: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n128: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%